[
  {
    "name": "New Bern",
    "slug": "new-bern",
    "description": "New Bern is a historic waterfront city and the second oldest town in North Carolina. As the Craven County seat, it offers businesses a unique opportunity to serve both locals and tourists visiting for its colonial charm and waterfront attractions.",
    "population": "30,000+",
    "keyIndustries": ["Tourism", "Healthcare", "Retail", "Manufacturing", "Professional Services"],
    "image": "/images/locations/new-bern.jpg"
  },
  {
    "name": "Greenville",
    "slug": "greenville",
    "description": "Greenville is the county seat of Pitt County and home to East Carolina University. As the major commercial center for Eastern North Carolina, it offers a growing market with a diverse economy driven by education, healthcare, and manufacturing.",
    "population": "87,000+",
    "keyIndustries": ["Healthcare", "Education", "Manufacturing", "Technology", "Retail"],
    "image": "/images/locations/greenville.jpg"
  },
  {
    "name": "Jacksonville",
    "slug": "jacksonville",
    "description": "Jacksonville is the principal city of Onslow County and home to Marine Corps Base Camp Lejeune. This military-influenced community offers businesses a unique demographic with a steady flow of new residents and a strong focus on service industries.",
    "population": "70,000+",
    "keyIndustries": ["Military", "Healthcare", "Retail", "Hospitality", "Construction"],
    "image": "/images/locations/jacksonville.jpg"
  },
  {
    "name": "Wilmington",
    "slug": "wilmington",
    "description": "Wilmington is a coastal city and the county seat of New Hanover County. Known for its historic riverfront, beaches, and film industry, it offers businesses access to both year-round residents and a substantial tourism market.",
    "population": "115,000+",
    "keyIndustries": ["Tourism", "Film Production", "Healthcare", "Education", "Technology", "Real Estate"],
    "image": "/images/locations/wilmington.jpg"
  },
  {
    "name": "Kinston",
    "slug": "kinston",
    "description": "Kinston is the county seat of Lenoir County and a center for arts, culture, and culinary tourism. Once a major tobacco market, the city has reinvented itself with a focus on local food, arts, and heritage tourism.",
    "population": "20,000+",
    "keyIndustries": ["Agriculture", "Manufacturing", "Healthcare", "Tourism", "Culinary Arts"],
    "image": "/images/locations/kinston.jpg"
  },
  {
    "name": "Morehead City",
    "slug": "morehead-city",
    "description": "Morehead City is a port town in Carteret County known for its fishing industry and access to the Crystal Coast. This waterfront community offers businesses opportunities in tourism, marine services, and supporting the region's coastal lifestyle.",
    "population": "9,000+",
    "keyIndustries": ["Tourism", "Fishing", "Maritime Industries", "Retail", "Real Estate"],
    "image": "/images/locations/morehead-city.jpg"
  }
]